In [1]:
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()

format_dict = {
              'price':'{:.2f}','unit_cost':'{:.2f}','qty':'{:,}',
              'amt':'{:,.2f}','gross':'{:,.2f}','net':'{:,.2f}','fee':'{:,.2f}','vat':'{:,.2f}'
              }

### Average cost calculation

In [2]:
name = 'KBANK'

In [3]:
sql = '''
SELECT B.id, S.name, date, qty, price, qty*price AS gross, fee, vat, net, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" AND status = "Active"
ORDER BY id DESC'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys.style.format(format_dict)

In [4]:
buys_grp = buys.groupby('name')[['gross','qty']].sum()
buys_grp['unit_cost'] = buys_grp.gross / buys_grp.qty
buys_grp.style.format(format_dict)

### Recalculate net cost by id

In [5]:
ids = buys['id']
ids

0    1074
1    1062
2    1057
Name: id, dtype: int64

In [6]:
new_price = 136.88

In [7]:
def update_buys_by_id(new_price,id):
    sql = "UPDATE buys SET price = %s, fee = qty*price*.00207, vat = fee*.07, net = (qty*price)+fee+vat WHERE id = %s"
    sql = sql % (new_price,id)
    rp = conpf.execute(sql)
    return "Records updated = " + str(id)

In [8]:
sql = '''
SELECT B.id, S.name, date, qty, price, qty*price AS gross, fee, vat, net, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" AND status = "Active"
ORDER BY id DESC'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys.style.format(format_dict)

In [9]:
i = 0
for id in ids:
    update_buys_by_id(new_price,id)
    i += 1

In [10]:
sql = '''
SELECT B.id, S.name, date, qty, price, qty*price AS gross, fee, vat, net, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" AND status = "Active"
ORDER BY id DESC'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys.style.format(format_dict)

### Delete active buy records (use in case of sold out)

In [4]:
sql = '''
SELECT B.id, S.name, date, qty, price, qty*price AS gross, fee, vat, net, status, kind
FROM buys B
JOIN stocks S ON B.stock_id = S.id 
WHERE name = "%s" AND status = "Active"
ORDER BY id DESC'''
sql = sql % name
buys = pd.read_sql(sql, conpf)
buys.style.format(format_dict)

In [6]:
ids = buys['id']
type(ids)

pandas.core.series.Series

In [12]:
in_p = ", ".join(map(lambda id: '%s' % id, ids))
in_p

'972, 966, 834, 833, 832, 831, 830'

In [13]:
sql_del = '''
DELETE FROM buys
WHERE id IN (%s)'''
sql_del = sql_del % in_p
print(sql_del)

DELETE FROM buys
WHERE id IN (972, 966, 834, 833, 832, 831, 830)

In [14]:
rp = conpf.execute(sql_del)
rp.rowcount

7